ObjectStorage/src/InformationRegisters/ох_ОчередьЗаданийОбъектногоХранилища/ох_ОчередьЗаданийОбъектногоХранилища.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ох_ОчередьЗаданийОбъектногоХранилища</name>
  <dimensions>
    <name>ИдентификаторЗаписи</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторПотока</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ObjectStorage/src/CommonModules/ох_ОбъектноеХранилищеСлужебный/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

#Область Настройки

Функция ИспользоватьИнтеграцию() Экспорт
	Возврат ЗначениеНастройки("ИспользоватьИнтеграцию");
КонецФункции

Функция СервисныйАккаунтПоУмолчанию() Экспорт
	Возврат ЗначениеНастройки("СервисныйАккаунтПоУмолчанию");
КонецФункции

Функция БакетПоУмолчанию() Экспорт
	Возврат ЗначениеНастройки("БакетПоУмолчанию");
КонецФункции

Функция КоличествоДнейХраненияЗаданий() Экспорт
	Возврат ЗначениеНастройки("КоличествоДнейХраненияЗаданий");
КонецФункции

Функция КоличествоДнейХраненияФайлов() Экспорт
	Возврат ЗначениеНастройки("КоличествоДнейХраненияФайлов");
КонецФункции

Функция МаксимальноеКоличествоПотоковОбработкиЗаданий() Экспорт
	Возврат ЗначениеНастройки("МаксимальноеКоличествоПотоковОбработкиЗаданий");
КонецФункции

Функция ОбрабатыватьОшибкиОчередиПовторно() Экспорт
	Возврат ЗначениеНастройки("ОбрабатыватьОшибкиПовторно");
КонецФункции

Функция МаксимальноеКоличествоПопытокОбработкиОшибокОчереди() Экспорт
	Возврат ЗначениеНастройки("МаксимальноеКоличествоПопытокОбработки");
КонецФункции

Функция БазоваяЗадержкаПриПовторнойОбработкиОшибокОчереди() Экспорт
	Возврат ЗначениеНастройки("БазоваяЗадержкаПриПовторнойОбработки");
КонецФункции

Функция КоличествоЗаданийВыполняемыхОднимПотоком() Экспорт
	Возврат ЗначениеНастройки("КоличествоЗаданийВыполняемыхОднимПотоком");
КонецФункции

#КонецОбласти

#Область ОбработкаЗаданий

Процедура ВыполнитьРегламентныеОперацииОбъектногоХранилища() Экспорт
	
	Если Не ох_ОбъектноеХранилище.ИспользоватьИнтеграцию() Тогда
		Возврат;
	КонецЕсли;
	
	ох_ОбъектноеХранилище.ВыполнитьРегламентныеОперацииОбъектногоХранилища();
	
КонецПроцедуры

Процедура ОбработатьЗадания() Экспорт
	
	ох_ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(
		Метаданные.РегламентныеЗадания.ох_ОбработкаЗаданийОбъектногоХранилища);
	
	Если Не ох_ОбъектноеХранилище.ИспользоватьИнтеграцию() Тогда
		Возврат;
	КонецЕсли;
	
	МаксимальноеКоличествоПотоковОбработкиЗаданий =
		ох_ОбъектноеХранилище.МаксимальноеКоличествоПотоковОбработкиЗаданий();
	
	Если МаксимальноеКоличествоПотоковОбработкиЗаданий <= 0 Тогда
		ох_ОбъектноеХранилище.ВыполнитьЗадания();
	Иначе
		ЗапуститьПотоковуюОбработкуЗаданий(МаксимальноеКоличествоПотоковОбработкиЗаданий);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПанельАдминистрирования

Функция РегламентныеЗаданияХранилища() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Задания = Новый Массив;
	
	Для Каждого РегламентноеЗадание Из ВсеРегламентныеЗаданияХранилища() Цикл
		
		ОписаниеРегламентногоЗадания = ОписаниеРегламентногоЗадания(РегламентноеЗадание);
		Задания.Добавить(ОписаниеРегламентногоЗадания);
		
	КонецЦикла;
	
	Возврат Задания;
	
КонецФункции

Функция ФоновыеЗаданияХранилища(ТолькоАктивные = Ложь) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Задания = Новый Массив;
	
	УправляющиеЗадания = УправляющиеЗадания(ТолькоАктивные);
	ПотокиЗаданий = ПотокиВыполненияЗаданий(ТолькоАктивные);
	
	Для Каждого УправляющиеЗадание Из УправляющиеЗадания Цикл
		
		ДанныеЗадания = ОписаниеФоновогоЗадания(УправляющиеЗадание);
		ЗаполнитьПотокиЗадания(ДанныеЗадания, ПотокиЗаданий);
		
		Задания.Добавить(ДанныеЗадания);
		
	КонецЦикла;
	
	Возврат Задания;
	
КонецФункции

Функция ОписаниеРегламентногоЗаданияПоИдентификатору(ИдентификаторЗадания) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Задание = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(ИдентификаторЗадания);
	
	Если Задание <> Неопределено Тогда
		Возврат ОписаниеРегламентногоЗадания(Задание);
	Иначе
		Возврат НовоеОписаниеРегламентногоЗадания();
	КонецЕсли;
	
КонецФункции

Функция ОписаниеФоновогоЗаданияПоИдентификатору(ИдентификаторЗадания) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Задание = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(ИдентификаторЗадания);
	
	Если Задание <> Неопределено Тогда
		Возврат ОписаниеФоновогоЗадания(Задание);
	Иначе
		Возврат НовоеОписаниеФоновогоЗадания();
	КонецЕсли;
	
КонецФункции

Функция ВыполнитьРегламентноеЗадание(ИдентификаторЗадания) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	РегламентноеЗадание = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(ИдентификаторЗадания);
	ФоновоеЗадание = ПоследнееФоновоеЗаданиеРегламентногоЗадания(РегламентноеЗадание);
	
	ЗапускВыполнен = Ложь;
	УжеВыполняется = Ложь;
	
	Если ФоновоеЗадание <> Неопределено
		И ФоновоеЗадание.Состояние = СостояниеФоновогоЗадания.Активно Тогда
		
		УжеВыполняется = Истина;
		
	Иначе
		
		НаименованиеФоновогоЗадания = СтрШаблон("Запуск вручную: %1", 
			ПредставлениеРегламентногоЗадания(РегламентноеЗадание));
		КлючФоновогоЗадания = Строка(РегламентноеЗадание.УникальныйИдентификатор);
		
		ФоновоеЗадание = ФоновыеЗадания.Выполнить(
			РегламентноеЗадание.Метаданные.ИмяМетода,
			РегламентноеЗадание.Параметры,
			КлючФоновогоЗадания,
			НаименованиеФоновогоЗадания);
			
		ЗапускВыполнен = Истина;
		
	КонецЕсли;
	
	Результат = Новый Структура;
	
	Результат.Вставить("ЗапускВыполнен", ЗапускВыполнен);
	Результат.Вставить("УжеВыполняется", УжеВыполняется);
	Результат.Вставить("Начало"        , ФоновоеЗадание.Начало);
	Результат.Вставить("Конец"         , ФоновоеЗадание.Конец);
	Результат.Вставить("Состояние"     , ФоновоеЗадание.Состояние);
	
	ПредставлениеФоновогоЗадания = ФоновоеЗадание.Наименование;
	Если Не ЗначениеЗаполнено(ПредставлениеФоновогоЗадания) Тогда
		ПредставлениеФоновогоЗадания = ПредставлениеРегламентногоЗадания(РегламентноеЗадание);
	КонецЕсли;
	Результат.Вставить("ПредставлениеФоновогоЗадания", ПредставлениеФоновогоЗадания);
	
	СообщениеОшибки = "";
	Если ФоновоеЗадание.ИнформацияОбОшибке <> Неопределено Тогда
		СообщениеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ФоновоеЗадание.ИнформацияОбОшибке);
	КонецЕсли;
	Результат.Вставить("СообщениеОшибки", СообщениеОшибки);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область НастройкиПодсистемы

Функция ЗначениеНастройки(ИмяНастройки)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ИмяКонстанты = ИмяКонстантыИзИмениНастройки(ИмяНастройки);
	Значение = Константы[ИмяКонстанты].Получить();
	
	Возврат Значение;
	
КонецФункции

Функция ИмяКонстантыИзИмениНастройки(ИмяНастройки)
	Возврат ПрефиксПодсистемы() + ИмяНастройки;
КонецФункции

Функция ПрефиксПодсистемы()
	Возврат "ох_";
КонецФункции

#КонецОбласти

#Область МногопоточнаяОбработкаЗаданий

Процедура ЗапуститьПотоковуюОбработкуЗаданий(КоличествоПотоков)
	
	Если УправляющееЗаданиеЗапущено() Тогда
		Возврат;
	КонецЕсли;
	
	ЗапуститьУправляющееЗадание();
	
КонецПроцедуры

#Область УправляющийПоток

Функция УправляющееЗаданиеЗапущено()
	
	Задания = УправляющиеЗадания(Истина);
	Возврат Задания.Количество() > 0;
	
КонецФункции

Функция УправляющиеЗадания(ТолькоАктивные = Ложь)
	
	ОтборУправляющегоЗадания = Новый Структура;
	ОтборУправляющегоЗадания.Вставить("ИмяМетода", МетодВыполненияУправляющегоЗадания());
	
	Возврат ФоновыеЗаданияПроцесса(ОтборУправляющегоЗадания, ТолькоАктивные);

КонецФункции

Процедура ЗапуститьУправляющееЗадание()
	
	ИдентификаторЗадания = XMLСтрока(Новый УникальныйИдентификатор());
	
	ФоновыеЗадания.Выполнить(
		МетодВыполненияУправляющегоЗадания(),
		ох_ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ИдентификаторЗадания),
		КлючУправляющегоЗадания(ИдентификаторЗадания),
		НаименованиеЗаданияПотоковойОбработки("Управляющее"));
	
КонецПроцедуры

Функция МетодВыполненияУправляющегоЗадания() Экспорт
	Возврат "ох_ОбъектноеХранилищеСлужебный.ВыполнитьОбработкуЗаданийПотоками";
КонецФункции

Процедура ВыполнитьОбработкуЗаданийПотоками(ИдентификаторУправляющегоЗадания) Экспорт
	
	МаксимальноеКоличествоПотоков    = ох_ОбъектноеХранилище.МаксимальноеКоличествоПотоковОбработкиЗаданий();
	ОжиданиеЗавершенияЗаданияСекунды = 5;
	ОжиданиеОчередиМиллисекунды      = 3000;
	
	Пока Истина Цикл
		
		АктивныеПотоки = ПотокиВыполненияЗаданий(Истина);
		КоличествоАктивныхПотоков = АктивныеПотоки.Количество();
		
		ОчиститьРегистрациюОчереди(АктивныеПотоки, ИдентификаторУправляющегоЗадания);
		
		ИспользоватьИнтеграцию = ИспользоватьИнтеграцию();
		
		Если ИспользоватьИнтеграцию
			И КоличествоАктивныхПотоков < МаксимальноеКоличествоПотоков Тогда
			
			ОчередьЗаданийОбработки = ОчередьЗаданий();
			
			Если Не ОчередьЗаданийОбработки.Количество() Тогда
				ВызватьПаузу(ОжиданиеОчередиМиллисекунды);
				Продолжить;
			КонецЕсли;
			
			ИдентификаторПотока = Строка(Новый УникальныйИдентификатор);
			
			ЗарегистрироватьОчередь(ОчередьЗаданийОбработки, ИдентификаторПотока);
			ЗапуститьПоток(ИдентификаторУправляющегоЗадания, ИдентификаторПотока);
			
		ИначеЕсли КоличествоАктивныхПотоков Тогда
			
			ФоновыеЗадания.ОжидатьЗавершенияВыполнения(АктивныеПотоки, ОжиданиеЗавершенияЗаданияСекунды);
			Продолжить;
			
		Иначе
			
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗарегистрироватьОчередь(ЗаданияОчереди, ИдентификаторПотока)
	
	МенеджерЗаданий = ох_ОбъектноеХранилище.МенеджерЗаданий();
	МенеджерОчереди = РегистрыСведений.ох_ОчередьЗаданийОбъектногоХранилища;
	
	Пока ЗаданияОчереди.Следующий() Цикл
		
		НачатьТранзакцию();
		Попытка
			
			МенеджерЗаданий.ПеренестиЗаданиеВОчередь(ЗаданияОчереди);
			
			ЗаписьОчереди = МенеджерОчереди.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(ЗаписьОчереди, ЗаданияОчереди);
			ЗаписьОчереди.ИдентификаторПотока = ИдентификаторПотока;
			ЗаписьОчереди.Записать();
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			ОтменитьТранзакцию();
			
			ЗаписьЖурналаРегистрации(
				СобытиеОбработкиОчереди(),
				УровеньЖурналаРегистрации.Ошибка,
				,
				,
				ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОчиститьРегистрациюОчереди(АктивныеПотоки, ИдентификаторУправляющегоЗадания)
	
	Менеджеры = Новый Структура;
	Менеджеры.Вставить("Задания", ох_ОбъектноеХранилище.МенеджерЗаданий());
	Менеджеры.Вставить("Очередь", РегистрыСведений.ох_ОчередьЗаданийОбъектногоХранилища);
	
	ИдентификаторыАктивныхПотоков = Новый Массив;
	Для Каждого Поток Из АктивныеПотоки Цикл
		ИдентификаторыАктивныхПотоков.Добавить(ИдентификаторЗаданияИзКлюча(Поток.Ключ));
	КонецЦикла;
	
	ОчередиПотоков = ОчередиНеактивныхПотоков(ИдентификаторыАктивныхПотоков);
	
	Пока ОчередиПотоков.Следующий() Цикл
		
		Если ОчередиПотоков.ЗаданиеВыполнено Тогда
			ОчиститьОчередьПотокаПакетно(ОчередиПотоков.ИдентификаторПотока, Менеджеры);
		Иначе
			
			ДанныеПотока = ДанныеПотокаПоИдентификатору(ИдентификаторУправляющегоЗадания, ОчередиПотоков.ИдентификаторПотока);
			ВыборкаЗаданий = ОчередиПотоков.Выбрать();
			ОбработкаОчередиПоЗаданиям(ВыборкаЗаданий, ДанныеПотока, Менеджеры);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ОчередиНеактивныхПотоков(ИдентификаторыАктивныхПотоков)
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	МенеджерЗаданий = ох_ОбъектноеХранилище.МенеджерЗаданий();
	МенеджерЗаданий.ПоместитьЗаданияВОчередиВМенеджерВременныхТаблиц(МенеджерВременныхТаблиц);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ох_ОчередьЗаданийОбъектногоХранилища.ИдентификаторЗаписи КАК ИдентификаторЗаписи,
		|	ох_ОчередьЗаданийОбъектногоХранилища.ИдентификаторФайла КАК ИдентификаторФайла,
		|	ох_ОчередьЗаданийОбъектногоХранилища.ИдентификаторПотока КАК ИдентификаторПотока,
		|	Задания.Период КАК Период,
		|	Задания.Файл КАК Файл,
		|	Задания.ВладелецФайла КАК ВладелецФайла,
		|	Задания.СервисныйАккаунт КАК СервисныйАккаунт,
		|	Задания.Бакет КАК Бакет,
		|	Задания.Файл ЕСТЬ NULL КАК ЗаданиеВыполнено
		|ИЗ
		|	РегистрСведений.ох_ОчередьЗаданийОбъектногоХранилища КАК ох_ОчередьЗаданийОбъектногоХранилища
		|		ЛЕВОЕ СОЕДИНЕНИЕ Задания КАК Задания
		|		ПО ох_ОчередьЗаданийОбъектногоХранилища.ИдентификаторЗаписи = Задания.ИдентификаторЗаписи
		|			И ох_ОчередьЗаданийОбъектногоХранилища.ИдентификаторФайла = Задания.ИдентификаторФайла
		|ГДЕ
		|	НЕ ох_ОчередьЗаданийОбъектногоХранилища.ИдентификаторПотока В (&ИдентификаторыАктивныхПотоков)
		|ИТОГИ
		|	МИНИМУМ(ЗаданиеВыполнено)
		|ПО
		|	ИдентификаторПотока";
	
	Запрос.УстановитьПараметр("ИдентификаторыАктивныхПотоков", ИдентификаторыАктивныхПотоков);
	
	Возврат Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
КонецФункции

Процедура ОчиститьОчередьПотокаПакетно(ИдентификаторПотока, Менеджеры)
	
	НаборЗаписей = Менеджеры.Очередь.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ИдентификаторПотока.Установить(ИдентификаторПотока);
	НаборЗаписей.Записать();
	
КонецПроцедуры

Процедура ОбработкаОчередиПоЗаданиям(Задания, ДанныеПотока, Менеджеры)
	
	Пока Задания.Следующий() Цикл
		
		НачатьТранзакцию();
		Попытка
			
			Запись = Менеджеры.Очередь.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(Запись, Задания);
			Запись.Удалить();
			
			Если Не Задания.ЗаданиеВыполнено Тогда
				
				Если ДанныеПотока.ЕстьДанныеПотока
					И (ДанныеПотока.Состояние = СостояниеФоновогоЗадания.ЗавершеноАварийно
					Или ДанныеПотока.Состояние = СостояниеФоновогоЗадания.Отменено) Тогда
					Менеджеры.Задания.УстановитьОшибкуВыполненияЗадания(Задания, ДанныеПотока.СообщениеОшибки);
				Иначе
					Менеджеры.Задания.ЗарегистрироватьЗаданиеКОбработке(Задания);
				КонецЕсли;
				
			КонецЕсли;
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			ОтменитьТранзакцию();
			
			ЗаписьЖурналаРегистрации(
				СобытиеОбработкиОчереди(),
				УровеньЖурналаРегистрации.Ошибка,
				,
				,
				ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ДанныеПотокаПоИдентификатору(ИдентификаторУправляющегоЗадания, ИдентификаторПотока)
	
	ДанныеПотока = Новый Структура;
	ДанныеПотока.Вставить("ЕстьДанныеПотока", Ложь);
	ДанныеПотока.Вставить("Состояние");
	ДанныеПотока.Вставить("СообщениеОшибки", "Неизвестная ошибка");
	
	ОтборЗадания = Новый Структура;
	ОтборЗадания.Вставить("Ключ", КлючПотока(ИдентификаторУправляющегоЗадания, ИдентификаторПотока));
	
	ЗаданияПотока = ФоновыеЗаданияПроцесса(ОтборЗадания);
	
	Если ЗаданияПотока.Количество() Тогда
		
		Поток = ЗаданияПотока[0];
		
		ДанныеПотока.ЕстьДанныеПотока = Истина;
		ДанныеПотока.Состояние        = Поток.Состояние;
		
		Если Поток.ИнформацияОбОшибке <> Неопределено Тогда
			ДанныеПотока.СообщениеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(Поток.ИнформацияОбОшибке);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ДанныеПотока;
	
КонецФункции

Функция ОчередьЗаданий()
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	МенеджерЗаданий = ох_ОбъектноеХранилище.МенеджерЗаданий();
	МенеджерЗаданий.ПоместитьЗаданияДляОбработкиВМенеджерВременныхТаблиц(МенеджерВременныхТаблиц);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Задания.Период КАК Период,
		|	Задания.Файл КАК Файл,
		|	Задания.ВладелецФайла КАК ВладелецФайла,
		|	Задания.СервисныйАккаунт КАК СервисныйАккаунт,
		|	Задания.Бакет КАК Бакет,
		|	Задания.Операция КАК Операция,
		|	Задания.Статус КАК Статус,
		|	Задания.ДатаНачалаВыполнения КАК ДатаНачалаВыполнения,
		|	Задания.ДатаОкончанияВыполнения КАК ДатаОкончанияВыполнения,
		|	Задания.КоличествоПопытокВыполнения КАК КоличествоПопытокВыполнения,
		|	Задания.ОписаниеОшибки КАК ОписаниеОшибки,
		|	Задания.Ответственный КАК Ответственный,
		|	Задания.ИдентификаторЗаписи КАК ИдентификаторЗаписи,
		|	Задания.ИдентификаторФайла КАК ИдентификаторФайла
		|ИЗ
		|	Задания КАК Задания
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ох_ОчередьЗаданийОбъектногоХранилища КАК ЗаданияВОбработке
		|		ПО Задания.ИдентификаторЗаписи = ЗаданияВОбработке.ИдентификаторЗаписи
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ох_ОчередьЗаданийОбъектногоХранилища КАК ФайлыВОбработке
		|		ПО Задания.ИдентификаторФайла = ФайлыВОбработке.ИдентификаторФайла
		|ГДЕ
		|	ЗаданияВОбработке.ИдентификаторПотока ЕСТЬ NULL
		|	И ФайлыВОбработке.ИдентификаторПотока ЕСТЬ NULL";
	
	КоличествоЗаданийНаПоток = ох_ОбъектноеХранилище.КоличествоЗаданийВыполняемыхОднимПотоком();
	Запрос.Текст = СтрЗаменить(
		Запрос.Текст,
		"ПЕРВЫЕ 1",
		СтрШаблон("ПЕРВЫЕ %1", Формат(КоличествоЗаданийНаПоток, "ЧРГ=; ЧГ=0")));
	
	Возврат Запрос.Выполнить().Выбрать();
	
КонецФункции

#КонецОбласти

#Область ПотокиВыполненияЗаданий

Функция ПотокиВыполненияЗаданий(ТолькоАктивные = Ложь)
	
	ОтборПотоков = Новый Структура;
	ОтборПотоков.Вставить("ИмяМетода", МетодВыполненияПотоков());
	
	Возврат ФоновыеЗаданияПроцесса(ОтборПотоков, ТолькоАктивные);
	
КонецФункции

Процедура ЗапуститьПоток(ИдентификаторУправляющегоЗадания, ИдентификаторПотока)
	
	ФоновыеЗадания.Выполнить(
		МетодВыполненияПотоков(),
		ох_ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ИдентификаторПотока),
		КлючПотока(ИдентификаторУправляющегоЗадания, ИдентификаторПотока),
		НаименованиеЗаданияПотоковойОбработки("Поток"));
	
КонецПроцедуры

Функция МетодВыполненияПотоков() Экспорт
	Возврат "ох_ОбъектноеХранилищеСлужебный.ЗапуститьПотокВыполненияЗадания";
КонецФункции

Процедура ЗапуститьПотокВыполненияЗадания(ИдентификаторПотока) Экспорт
	
	ЗаданияДляПотока = ЗаданияДляПотока(ИдентификаторПотока);
	ох_ОбъектноеХранилище.МенеджерЗаданий().ОбработатьОчередьЗаданий(ЗаданияДляПотока);
	
КонецПроцедуры

Функция ЗаданияДляПотока(ИдентификаторПотока)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ох_ОчередьЗаданийОбъектногоХранилища.ИдентификаторЗаписи КАК ИдентификаторЗаписи
		|ИЗ
		|	РегистрСведений.ох_ОчередьЗаданийОбъектногоХранилища КАК ох_ОчередьЗаданийОбъектногоХранилища
		|ГДЕ
		|	ох_ОчередьЗаданийОбъектногоХранилища.ИдентификаторПотока = &ИдентификаторПотока";
	
	Запрос.УстановитьПараметр("ИдентификаторПотока", ИдентификаторПотока);
	ИдентификаторыЗаданийПотока = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ИдентификаторЗаписи");
	
	Возврат ох_ОбъектноеХранилище.МенеджерЗаданий().ЗаданияПоИдентификаторам(ИдентификаторыЗаданийПотока);

КонецФункции

#КонецОбласти

Функция ИдентификаторЗаданияИзКлюча(Ключ, ДлинаИдентификатора = 36)
	Возврат Прав(Ключ, ДлинаИдентификатора);
КонецФункции

Функция ИдентификаторРодителя(Ключ, ДлинаИдентификатора = 36)
	Возврат Лев(СтрЗаменить(Ключ, ОбщийКлючЗаданий(), ""), ДлинаИдентификатора);
КонецФункции

Функция КлючУправляющегоЗадания(ИдентификаторУправляющегоЗадания)
	Возврат СтрШаблон("%1%2", ОбщийКлючЗаданий(), ИдентификаторУправляющегоЗадания);
КонецФункции

Функция КлючПотока(ИдентификаторУправляющегоЗадания, ИдентификаторПотока)
	Возврат СтрШаблон("%1_%2", КлючУправляющегоЗадания(ИдентификаторУправляющегоЗадания), ИдентификаторПотока);
КонецФункции

Функция ОбщийКлючЗаданий()
	Возврат "ОбработкаЗаданийОбъектногоХранилища_";
КонецФункции

Функция НаименованиеЗаданияПотоковойОбработки(НаименованиеЗадания)
	Возврат СтрШаблон("Обработка заданий объектного хранилища (%1)", НаименованиеЗадания);
КонецФункции

Функция ФоновыеЗаданияПроцесса(ОтборЗаданий, ТолькоАктивные = Ложь)
	
	Если ТолькоАктивные Тогда
		ОтборЗаданий.Вставить("Состояние", СостояниеФоновогоЗадания.Активно);
	КонецЕсли;
	
	Возврат ФоновыеЗадания.ПолучитьФоновыеЗадания(ОтборЗаданий);
	
КонецФункции

Функция СобытиеОбработкиОчереди()
	Возврат "Объектное хранилище.Обработка очереди заданий";
КонецФункции

#КонецОбласти

#Область Администрирование

Функция ОписаниеРегламентногоЗадания(РегламентноеЗадание)
	
	Задание = НовоеОписаниеРегламентногоЗадания();
	
	Задание.Имя                     = РегламентноеЗадание.Метаданные.Имя;
	Задание.Использование           = РегламентноеЗадание.Использование;
	Задание.Наименование            = РегламентноеЗадание.Наименование;
	Задание.Ключ                    = РегламентноеЗадание.Ключ;
	Задание.УникальныйИдентификатор = РегламентноеЗадание.УникальныйИдентификатор;
	Задание.ИмяПользователя         = РегламентноеЗадание.ИмяПользователя;
	Задание.Параметры               = РегламентноеЗадание.Параметры;
	Задание.Расписание              = РегламентноеЗадание.Расписание;
	Задание.ИмяМетода               = РегламентноеЗадание.Метаданные.ИмяМетода;
	
	Задание.ИнтервалПовтораПриАварийномЗавершении    = РегламентноеЗадание.ИнтервалПовтораПриАварийномЗавершении;
	Задание.КоличествоПовторовПриАварийномЗавершении = РегламентноеЗадание.КоличествоПовторовПриАварийномЗавершении;
	
	ПоследнееФоновоеЗадание = ПоследнееФоновоеЗаданиеРегламентногоЗадания(РегламентноеЗадание);
	
	Если ПоследнееФоновоеЗадание = Неопределено Тогда
		Возврат Задание;
	КонецЕсли;
	
	ДанныеЗадания = ОписаниеФоновогоЗадания(ПоследнееФоновоеЗадание);
	
	Задание.СообщениеОшибки = ДанныеЗадания.СообщениеОшибки;
	Задание.Начало          = ДанныеЗадания.Начало;
	Задание.Конец           = ДанныеЗадания.Конец;
	Задание.Состояние       = ДанныеЗадания.Состояние;
	Задание.ИмяПользователя = ДанныеЗадания.ИмяПользователя;
	
	Возврат Задание;
	
КонецФункции

Функция НовоеОписаниеРегламентногоЗадания()
	
	ОписаниеРегламентногоЗадания = Новый Структура;
	
	ОписаниеРегламентногоЗадания.Вставить("Использование", Ложь);
	
	ОписаниеРегламентногоЗадания.Вставить("Имя"         , "");
	ОписаниеРегламентногоЗадания.Вставить("Наименование", "");
	ОписаниеРегламентногоЗадания.Вставить("Ключ"        , "");
	ОписаниеРегламентногоЗадания.Вставить("УникальныйИдентификатор");
	
	ОписаниеРегламентногоЗадания.Вставить("ИнтервалПовтораПриАварийномЗавершении"   , 0);
	ОписаниеРегламентногоЗадания.Вставить("КоличествоПовторовПриАварийномЗавершении", 0);
	
	ОписаниеРегламентногоЗадания.Вставить("ИмяПользователя", "");
	ОписаниеРегламентногоЗадания.Вставить("Параметры"      , Новый Массив);
	ОписаниеРегламентногоЗадания.Вставить("Расписание"     , Новый РасписаниеРегламентногоЗадания);
	ОписаниеРегламентногоЗадания.Вставить("ИмяМетода"      , "");
	ОписаниеРегламентногоЗадания.Вставить("СообщениеОшибки", "");
	ОписаниеРегламентногоЗадания.Вставить("Начало"         , Дата(1, 1, 1));
	ОписаниеРегламентногоЗадания.Вставить("Конец"          , Дата(1, 1, 1));
	ОписаниеРегламентногоЗадания.Вставить("Состояние"      , "");
	
	Возврат ОписаниеРегламентногоЗадания;
	
КонецФункции

Функция ПоследнееФоновоеЗаданиеРегламентногоЗадания(РегламентноеЗадание)
	
	ПоследнееЗадание = Неопределено;
	
	ФоновыеЗаданияРегламентногоЗадания = Новый Массив;
	
	Если РегламентноеЗадание.ПоследнееЗадание <> Неопределено Тогда
		ФоновыеЗаданияРегламентногоЗадания.Добавить(РегламентноеЗадание.ПоследнееЗадание);
	КонецЕсли;
	
	Отбор = Новый Структура;
	Отбор.Вставить("Ключ", РегламентноеЗадание.УникальныйИдентификатор);
	Задания = ФоновыеЗадания.ПолучитьФоновыеЗадания(Отбор);
	ох_ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ФоновыеЗаданияРегламентногоЗадания, Задания);
	
	Отбор = Новый Структура;
	Отбор.Вставить("РегламентноеЗадание", РегламентноеЗадание);
	Задания = ФоновыеЗадания.ПолучитьФоновыеЗадания(Отбор);
	ох_ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ФоновыеЗаданияРегламентногоЗадания, Задания);
	
	Если Не ФоновыеЗаданияРегламентногоЗадания.Количество() Тогда
		Возврат ПоследнееЗадание;
	КонецЕсли;
	
	ПоследнееЗадание = ФоновыеЗаданияРегламентногоЗадания[0];
	
	Для Каждого Задание Из ФоновыеЗаданияРегламентногоЗадания Цикл
		
		Если ЗначениеЗаполнено(ПоследнееЗадание.Конец) Тогда
			
			Если Не ЗначениеЗаполнено(Задание.Конец)
				Или ПоследнееЗадание.Конец < Задание.Конец Тогда
				ПоследнееЗадание = Задание;
			КонецЕсли;
			
		Иначе
			
			Если Не ЗначениеЗаполнено(Задание.Конец)
				И ПоследнееЗадание.Начало < Задание.Начало Тогда
				ПоследнееЗадание = Задание;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ПоследнееЗадание;
	
КонецФункции

Функция ОписаниеФоновогоЗадания(ФоновоеЗадание) Экспорт
	
	ДанныеЗадания = НовоеОписаниеФоновогоЗадания();
	
	ЗаполнитьЗначенияСвойств(ДанныеЗадания, ФоновоеЗадание);
	
	Если ФоновоеЗадание.ИнформацияОбОшибке <> Неопределено Тогда
		ДанныеЗадания.СообщениеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ФоновоеЗадание.ИнформацияОбОшибке);
	КонецЕсли;
	
	ДанныеЗадания.Идентификатор         = ИдентификаторЗаданияИзКлюча(ФоновоеЗадание.Ключ);
	ДанныеЗадания.ИдентификаторРодителя = ИдентификаторРодителя(ФоновоеЗадание.Ключ);
	
	ПредставлениеСостояния = ПредставлениеСостояний()[ФоновоеЗадание.Состояние];
	Если ПредставлениеСостояния <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(ДанныеЗадания, ПредставлениеСостояния);
	КонецЕсли;
	
	ДанныеЗадания.ИмяПользователя = ИмяПользователяЗаданий();

	Возврат ДанныеЗадания;
	
КонецФункции

Функция НовоеОписаниеФоновогоЗадания()
	
	ДанныеЗадания = Новый Структура;
	ДанныеЗадания.Вставить("ИмяМетода"            , "");
	ДанныеЗадания.Вставить("СообщениеОшибки"      , "");
	ДанныеЗадания.Вставить("Ключ"                 , "");
	ДанныеЗадания.Вставить("Начало"               , Дата(1, 1, 1));
	ДанныеЗадания.Вставить("Конец"                , Дата(1, 1, 1));
	ДанныеЗадания.Вставить("Наименование"         , "");
	ДанныеЗадания.Вставить("Состояние"            , "");
	ДанныеЗадания.Вставить("Идентификатор"        , "");
	ДанныеЗадания.Вставить("ИдентификаторРодителя", "");
	ДанныеЗадания.Вставить("ПодчиненныеПотоки"    , Новый Массив);
	ДанныеЗадания.Вставить("КартинкаСтроки"       , 0);
	ДанныеЗадания.Вставить("ИмяПользователя"      , "");
	ДанныеЗадания.Вставить("УникальныйИдентификатор");
	
	Возврат ДанныеЗадания;
	
КонецФункции

Функция ПредставлениеСостояний()
	
	Представление = Новый Соответствие;
	
	Представление.Вставить(СостояниеФоновогоЗадания.Активно,
		Новый Структура("Состояние, КартинкаСтроки", "Активно", 2));
	Представление.Вставить(СостояниеФоновогоЗадания.Завершено,
		Новый Структура("Состояние, КартинкаСтроки", "Завершено", 1));
	Представление.Вставить(СостояниеФоновогоЗадания.ЗавершеноАварийно,
		Новый Структура("Состояние, КартинкаСтроки", "Завершено аварийно", 3));
	Представление.Вставить(СостояниеФоновогоЗадания.Отменено,
		Новый Структура("Состояние, КартинкаСтроки", "Отменено", 3));
	
	Возврат Представление;
	
КонецФункции

Процедура ЗаполнитьПотокиЗадания(ДанныеЗадания, Потоки)
	
	Для Каждого Поток Из Потоки Цикл
		
		Если СтрНайти(Поток.Ключ, ДанныеЗадания.Ключ) Тогда
			
			ДанныеПотока = ОписаниеФоновогоЗадания(Поток);
			ДанныеЗадания.ПодчиненныеПотоки.Добавить(ДанныеПотока);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ИмяПользователяЗаданий()
	
	Для Каждого РегламентноеЗадание Из ВсеРегламентныеЗаданияХранилища() Цикл
		Если ЗначениеЗаполнено(РегламентноеЗадание.ИмяПользователя) Тогда
			Возврат РегламентноеЗадание.ИмяПользователя;
		КонецЕсли;
	КонецЦикла;
	
	Возврат "";
	
КонецФункции

Функция ВсеРегламентныеЗаданияХранилища()
	
	Задания = Новый Массив;
	
	Задание = РегламентныеЗадания.НайтиПредопределенное(
		Метаданные.РегламентныеЗадания.ох_ОбработкаЗаданийОбъектногоХранилища);
	Задания.Добавить(Задание);
	
	Задание = РегламентныеЗадания.НайтиПредопределенное(
		Метаданные.РегламентныеЗадания.ох_РегламентныеОперацииОбъектногоХранилища);
	Задания.Добавить(Задание);
	
	Возврат Задания;
	
КонецФункции

Функция ПредставлениеРегламентногоЗадания(Задание) Экспорт
	
	Результат = "Не определено";
	
	Если Задание <> Неопределено Тогда
		
		Результат = Задание.Наименование;
		
		Если Не ЗначениеЗаполнено(Результат) Тогда
			Результат = Задание.Метаданные.Представление();
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецОбласти
